---
kind: property
id: P:Autodesk.Revit.DB.ElementNode.ElementId
source: html/d030f0f5-76f5-2f33-d3fd-14e383de6b7b.htm
---
# Autodesk.Revit.DB.ElementNode.ElementId Property

The Id of the element.

## Syntax (C#)
```csharp
public ElementId ElementId { get; }
```